app/controllers/rooms_controller.rb

INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "forth room"], ["is_private", false], ["created_at", "2023-09-14 12:39:38.299010"], ["updated_at", "2023-09-14 12:39:38.299010"]]
---
  def create
    @room = Room.create(name: params["room"]["name"])